<template>
    <div class="show">
      <header>
        <div @click="goToUser">
          <img src="./back.png" alt="">
        </div>
        {{list.header}}
      </header>
      <main class="main">
        <div class="main-img">
          <img :src="list.img" alt="">
        </div>
        <div class="main-text">本月运势</div>
      </main>
      <div class="bottom">
        <div class="bottom-flex">
          <div class="flex1">
            <img src="./1.png" alt="" class="img1">
          </div>
          <div class="flex2" v-if="list.isAll === 1"><div class="line"></div><div>健康</div><div class="line"></div></div>
          <div class="flex2" v-if="list.isAll === 2"><div class="line"></div><div>整体</div><div class="line"></div></div>
          <div class="flex3">{{list.title1}}</div>
        </div>
        <div class="bottom-flex">
          <div class="flex1">
            <img src="./2.png" alt="" class="img2">
          </div>
          <div class="flex2"><div class="line"></div><div>爱情</div><div class="line"></div></div>
          <div class="flex3">{{list.title2}}</div>
        </div>
        <div class="bottom-flex">
          <div class="flex1">
            <img src="./3.png" alt="" class="img3">
          </div>
          <div class="flex2"><div class="line"></div><div>财富</div><div class="line"></div></div>
          <div class="flex3">{{list.title3}}</div>
        </div>
        <div class="bottom-flex">
          <div class="flex1">
            <img src="./4.png" alt="" class="img4">
          </div>
          <div class="flex2"><div class="line"></div><div>工作</div><div class="line"></div></div>
          <div class="flex3">{{list.title4}}</div>
        </div>
      </div>
    </div>
</template>

<script>
import router from '@/router'
export default {
  name: 'Show',
  data () {
    return {
      list: {},
      lists: [
        {'header': '白羊座', 'isAll': 1, 'img': require('./001.png'), 'title1': '情绪敏感，如果有忧郁倾向，需要注意，不要沉迷在自己的想象里。', 'title2': '喜欢和另一半呆在家里，这让你觉得很有安全感，你的体贴让你们的恋情多了些甜蜜。单身的人，在家或者出去逛都很好。', 'title3': '正财运不错，收入来源于你的专业技能或特长。', 'title4': '能得到合作伙伴的支持，因为灵活的沟通能力，领导对你也颇为倚重。做事更加稳妥，不乏创造力，职场竞争力提升。'},
        {'header': '金牛座', 'isAll': 1, 'img': require('./002.png'), 'title1': '注意睡眠质量，另外，短途旅行中注意交通安全，避让突然冲出来的快车。', 'title2': '有伴的人，彼此沟通或者外出旅行，容易激发嫉妒心、控制欲，建议用爱化解。单身的人，这个月更喜欢工作和赚钱。', 'title3': '正财运因为工作中机会多而有多项收入。偏财比如投资方面，仍然要注意长久规划。', 'title4': '众人支持，比较顺利。如果在外应酬发生一些说不清楚的误会，不要冲动，冷静处理。'},
        {'header': '双子座', 'isAll': 1, 'img': require('./003.png'), 'title1': '睡眠质量很高，关注下另一半的健康。', 'title2': '有伴的人，享受甜蜜的二人世界。单身的人，容易有暗桃花。', 'title3': '正财运平稳，投机活动宜见好就收。', 'title4': '某些付出了努力的贷款申请、对外投资等有希望得到回报。合作中，出现的意见分歧，也许会得到解决。'},
        {'header': '巨蟹座', 'isAll': 1, 'img': require('./004.png'), 'title1': '情绪敏感，可能会生闷气，当心气坏了身体。', 'title2': '有伴的人，变得更加敏感，可能使得恋爱关系有些紧张，不妨和朋友一起出去玩。单身的人，魅力剧增，快去参加聚会活动吧。', 'title3': '财运来自于良好的顾客关系。', 'title4': '行动力增强，有些敏感，合作关系更加稳固，应酬活动左右逢源。'},
        {'header': '狮子座', 'isAll': 1, 'img': require('./005.png'), 'title1': '比平时更为敏感，小心陷在恐惧忧郁的不良情绪中。', 'title2': '忙于工作，忽视了另一半，多陪陪心上人吧。单身的人，虽然魅力值满满，却好像不太愿意曝光，低调行事更有安全感。', 'title3': '工作上的付出得到回报。', 'title4': '工作中受人瞩目，付出有了回报，如果有小人，不要与之起正面冲突。'},
        {'header': '处女座', 'isAll': 1, 'img': require('./006.png'), 'title1': '健康状况良好。', 'title2': '与恋人外出游玩，自己的敏感，容易激发控制欲，出现误会，不用害怕，也许只是对方有些迷迷糊糊。', 'title3': '木星顺行，财务上的好运又回来了，平时的人脉对财运也有助益。', 'title4': '工作上演讲变多，与领导的沟通主要围绕一些贷款、投资等实际的资源，对交际应酬有些敏感，合作关系，小心滋生误会。'},
        {'header': '天秤座', 'isAll': 1, 'img': require('./007.png'), 'title1': '健康运平稳，注意兄弟姐妹的健康。', 'title2': '是别人眼中恩爱的一对，恋情甜蜜。单身的人，这个月魅力不减。', 'title3': '偏财运好，投资合约易签，长期投资有回报。', 'title4': '也许要与多个领导沟通，在贷款、投资事务的谈判上有好运，利于签约。'},
        {'header': '天蝎座', 'isAll': 1, 'img': require('./008.png'), 'title1': '身心健康，睡眠良好，精力充沛。', 'title2': '恋情甜蜜，如果一起长途旅行，小心产生误会。单身的人，和闺蜜在一起，身心愉悦。', 'title3': '合作关系助力财运的提升。', 'title4': '与人合作愉快，忙于专业技能的提升。'},
        {'header': '射手座', 'isAll': 1, 'img': require('./009.png'), 'title1': '与人合作愉快，忙于专业技能的提升。', 'title2': '和另一半的娱乐活动变少，这一段时间忙于工作。单身的人，不管是工作还是聚会，都很愉悦。', 'title3': '财运的提升来自于踏实努力的工作和良好的合作关系。', 'title4': '应酬活动受人欢迎，你也喜欢和大家聊天，但是有些谈判，你依然会慎重，不用担心，问题不大，进展会很平稳。'},
        {'header': '摩羯座', 'isAll': 1, 'img': require('./010.png'), 'title1': '健康运平稳。', 'title2': '有伴的人，爱情甜蜜。单身的人，做自己喜欢的事让你内心舒适。', 'title3': '偏财运不错。如果想买彩票，这个月可以试一试，但要注意见好就收。', 'title4': '事业运仍不错。合作关系上有些敏感，彼此之间的沟通要注意保持清晰，模糊易生误会。'},
        {'header': '水瓶座', 'isAll': 1, 'img': require('./011.png'), 'title1': '精神有些焦虑，多注意放松。', 'title2': '有伴的人，在家或者长途旅行都很好。单身的人，在家会得到身心的放松。', 'title3': '不动产方面有进账。', 'title4': '工作任务变多，忙忙碌碌，有些敏感，精神有些紧绷，学习、长途旅行、领导的支持，能让你充满信心。'},
        {'header': '双鱼座', 'isAll': 1, 'img': require('./012.png'), 'title1': '健康状况良好。', 'title2': '对另一半更为关注、体贴，彼此甜言蜜语变多，注意不要胡思乱想误解另一半。单身的人，如果不喜欢人多的聚会，就和闺蜜好友一起出去玩吧。', 'title3': '投资有收益，投机要当心受骗。', 'title4': '忙于和投资人谈判，自己也会非常小心、周全行事。或者工作上需要自己表现的机会变多，不要担心，大家是支持你的。'},
        {'header': '子鼠', 'isAll': 2, 'img': require('./013.png'), 'title1': '前5日行水木运，运气呈下行势头，事业上可得到贵人的帮助，利于和领导上司之间的协作，但也会偶有闹心，略有压力。6日“芒种”节气后，正式步入“正官坐财”之运，本月正官透出而坐财，多主导本月容易有来自领导上司的约束和压力。月建为偏财和生肖鼠构成了相冲，多主动偏财运易有起伏，为辛苦求财，谋事容易产生阻力。其次月建午火和太岁为午戌半合，主导求偏财需要接受官方的约束。', 'title2': '本月生肖鼠逢月建为偏财星，月干为正官星。多主生肖鼠男生的异性缘产生了波动，多遇到漂亮的异性，但容易产生阻力或是追求难度大。而生肖鼠女生因其异性星也临月干出现，所以生肖鼠女生的异性缘也不错，但也要提防种种波折和阻力。', 'title3': '本月生肖鼠逢月建偏财星冲击了自身，多主导偏财运起伏较大，易有反复，其次月建和太岁午戌半合，主导容易求取偏财需要接受官方的约束和督促，压力比较大，多辛苦操劳。本月财运主要为偏财，但容易产生种种阻力，需要多奔波，收益不会很多。', 'title4': '本月逢“月建冲身，月干临官”的组合，多主导在事业上易有反复，多奔波和折腾，甚至会面临一定的阻力。其次，容易在事业上多易有压力，容易被领导上司严格要求，多各种督促，但也能够得到领导上司的重视。'},
        {'header': '丑牛', 'isAll': 2, 'img': require('./014.png'), 'title1': '属牛2018年受太岁所刑，形势不容乐观，事业上竞争比较激烈，小人出没，私下容易破财，容易和人结怨，引发是非矛盾，容易受到兄弟朋友的牵连，甚至引发牢狱之灾。平时多注意自身言行，避免引来口舌之灾，凡事需多加考虑，避免盲目自大。', 'title2': '一、急躁而引起争吵，因此夫妻双方要多沟通，避免口舌之争，互相谦让，即使要离也需冷静后才可决定，避免带来不可承受的伤害。因为戊土劫财星和偏财星癸水存在戊癸相合，所以与异性交往时非常容易遭遇各种竞争，容易失败。', 'title3': '主导属牛人今年财运不通，事业上会因为竞争不利或者盲目激进而破财。同时受太岁丑戌相刑，结果是五行水受损，也是破财的标志。所以，容易受兄弟朋友牵连而破财，导致反目或出现感情破裂。', 'title4': '2018年属牛人遇岁星相刑，同时遭遇戊土劫财透出，主导今年事业上竞争激烈，会因为竞争对手的出现而导致属牛人的个人利益收到损害或是侵害。在事业仕途方面宜采取保守策略，宜韬光养晦，切忌好大喜功，只求明哲保身安然度过狗年。'},
        {'header': '寅虎', 'isAll': 2, 'img': require('./015.png'), 'title1': '运气呈上行势头，事业上可得到贵人的关照，利于项目合作，利于物质运，甚至会有姻缘运。6日“芒种”节气后，将步入“偏财坐伤”之运，月干透出偏财，多主本月多易有不错的偏财运，但也多辛苦操劳，需要主动去争取。月建伤官合生肖虎和太岁，构成寅午戌三合火局，多主利于大项目的运作，利于文化项目或是技术项目的合作，利于财运。', 'title2': '本月生肖虎异性星财星透出月干，主导生肖虎男生的异性缘比较旺，容易因为一些热闹的聚会而和异性认识，并获得愉快的互动，十分适合发展感情。而女生的话，人缘也不错，多能结交较多的异性，可以择一发展，但需要自身多一些主动，否则对方有时感觉不到，或是被蒙在鼓里。', 'title3': '本月生肖虎逢偏财星临年月干透出，而月建和太岁并生肖虎三合火局，令年月偏财星更旺，所以本月生肖虎容易因为项目合作而有不错的偏财运，但也多辛苦操劳，需要自身努力去争取和面对，容易在火土项目上获利，或是文化项目，技术项目上获利。另，本月偏财坐伤官，若无项目合作，却也利于营销策划，才艺发挥而获利。', 'title4': '本月事业上逢寅午戌三合火局，多主导利于传统项目的合作，利于文化项目的合作，但多各种辛苦操劳，容易获得不错的业绩。另外，非运作项目的生肖虎的话，则容易在一些研究领域获得突破，或是技术领域得到突破。'},
        {'header': '卯兔', 'isAll': 2, 'img': require('./016.png'), 'title1': '前5日行水木运，运气呈上行势头，事业上多利于合作，容易得到贵人的关照和扶持，利于应聘求职，利于业绩提升。6日“芒种”节气后，将会步入“正财坐食”之运，月干透出正财，多主导本月利于正财运，容易获得合理合法的收益，明面的收益。月建为食神和生肖兔成卯午相破，多主导生肖兔私下多有闹心，容易因为自身的欲望所导致。但月建和太岁为午戌半合火局，构成了食神生财的组合，多主导私下会有一些项目合作而利于财运。', 'title2': '本月生肖兔逢天喜星出，且年月透出正财星。多主导本月姻缘运变好，多容易在一些喜事的场合而遭遇异性缘。且生肖兔男生的异性星透出，那对于男生来说，异性缘必然多容易引发，容易遭遇自己喜欢的异性，获得感情。而女生虽然桃花运也不弱，但不宜太过随性，否则容易给异性带来压抑。', 'title3': '本月财星透出年月干为正财星，而月建和太岁构成了食神生财的组合。主导本月生肖兔正财运不错，会因为项目合作而获得不错的正财运，多为合理合法的财运，众人能够看到的收益，受到律法保护的正常收益。但私下多会因为个人的一些喜好而多有折腾和闹心，或是为此而产生一些不必要的破费。', 'title4': '本月事业逢“食神生财”之运，多主导日常不容易受到领导上司的约束，领导上司多隐藏在幕后，不怎么干涉或是约束自己，但也不宜太急躁，否则也会给上司带来压力。其次，本月多利于项目合作，利于业绩提升，只是也多辛劳。'},
        {'header': '辰龙', 'isAll': 2, 'img': require('./017.png'), 'title1': '前5日行水木运，运气呈上行势头，事业上利于项目合作，但日常也多有劳心，并会遭遇一些压力或是因为兄弟朋友而产生一些破费。6日“芒种”节气后，将步入“比肩坐印”运，比肩临年月透出，主导生肖龙本月多各种主动，需要经常抛头露面，去争取自己喜欢的事物。月建为正印和太岁构成了午戌半合火局，多主导私下也会面临一定的竞争，但自己可以借力而去发挥。', 'title2': '本月生肖龙异性星不见，但戊土比肩坐在了午火正印之上，而午火为天生的桃花，多主导容易遇到热情阳光的异性，并且自身也会占据一定的优势，但自身也需要多努力去争取，否则感情上有机遇，但难把握。', 'title3': '本月财星不出，但遭遇月建为正印生了月干戊土比肩，且月建和太岁构成了午戌半合火局，也是利于戊土比肩。则多主导本月的财运多为职称提升或是福利待遇得到了提升，容易得到贵人的关照，或是长辈的一些关照而利于自身，一般多为正财。', 'title4': '本月对于生肖龙来说，逢“比肩坐印”运，多主事业上多利于进修学习，利于职称待遇的提升，私下容易得到贵人的关照，但也会面临一定的竞争，自己可以借势而去促成自己事业上的突破，需要多抓住机遇。'},
        {'header': '巳蛇', 'isAll': 2, 'img': require('./018.png'), 'title1': '整体：前5日行水木运，运气呈两极转换的势头，事业上前期多压力和奔波，后期则利于项目合作，可以得到贵人的关照，但也费心。6日“芒种”节气后，将步入“食神坐劫”之运，月干食神透出多主本月自己多轻松自在，易有吃请行为，或是经常参与一些娱乐。月建为劫财且和太岁为午戌半合火局，主导私下容易和兄弟朋友经常聚众享乐。', 'title2': '本月生肖蛇逢咸池星现，多主导易有异性缘。多易遭遇热情阳光漂亮的异性，但需要以对方为中心，这样更容易获得感情上的突破，已婚者易犯桃花。', 'title3': '本月财星不现，但年月透出食神星，食神具备生财的功能，也主导贪玩享乐。但不可能经济压力很大还去享乐，所以本月纵然不能发财，但经济上也不会有压力。只是可能是因为兄弟朋友而经常有吃请娱乐，但自身无吃亏信号。', 'title4': '本月逢“食神坐劫”，多主导本月事业上多轻松愉快，事少麻烦少。但本月也主导生肖蛇主动性不强，不会刻意的去竞争，私下也不太利于项目上的竞争。'},
        {'header': '午马', 'isAll': 2, 'img': require('./019.png'), 'title1': '前5日行水木运，运气呈下行和上行转换势头，事业上前期容易有压力和费心，后期则容易得到贵人的关照，但也容易有竞争。6日“芒种”节气后，将步入“伤官坐比”运，月干伤官透出多主任性，叛逆，偏激，也主导利于技术上也。月建为比肩和太岁为午戌半合火局，主导本月多主动，利于项目合作，利于技术上的合作。', 'title2': '本月生肖马临月建而面对太岁为半合火局，无论男女生均异性星不出。所有，本月生肖马仅是人缘还不错，也可能会因为参与一些聚会而和异性认识，但发展感情还得多多努力和主动。', 'title3': '本月财星藏于太岁而不出，年月透出伤官星，此星虽然具备生财的功能，除非生肖马命运中带了财星而得生，否则未必能够发大财，甚至容易出是非。但是本月生肖马构成了半合火局，主导利于技术上的合作，地产项目的合作，所以也可以因此而产生一定的收获，只是自身会略有操劳。', 'title4': '本月逢“半合火局”运，多主导生肖马本月事业上人缘不错，利于人际关系的交往，利于技术上的合作或是地产项目上的合作，利于个人技能的发挥和提升。日常少受到领导上司的约束，多可以按照自己的意志去发挥。'},
        {'header': '未羊', 'isAll': 2, 'img': require('./020.png'), 'title1': '前5日行水木运，运气呈下行势头，事业上前期易有压力和奔波，后期则利于项目上的合作，利于和领导上司之间的协作。6日“芒种”节气后，将步入“劫财坐印”之运，逢月干劫财透出，多主本月容易面临竞争和矛盾是非，花钱的地方多，容易引发破财。月建偏印和生肖羊成午未相生合，多主导私下易得到贵人的帮助，多利于自身或是因为父母长辈关照而获得一定的利益。同时月建和太岁构成了午戌半合火局，多主导私下容易遭遇竞争，容易被抢夺一些机遇。', 'title2': '本月生肖羊逢月建相合，多主导人缘不错，但因为异性星不出，且不逢桃花，所以生肖羊本月只能凭借自己的好人缘而去争夺那一份少有的异性缘，且容易存在竞争，不宜太较真，否则也容易产生矛盾。', 'title3': '本月生肖羊财星不出，但逢月建和生肖羊构成了相生合的关系，且月建和太岁还构成了午戌半合火局，年月均透出了劫财星。主导本月生肖羊花钱的地方多，容易明显的产生破财，能够让人看到的花费。其次，则是私下可以得到贵人的关照而利于自身，但也会面临竞争，利益被抢夺或是分享，总体是半好半坏。', 'title4': '本月逢“劫财坐印”，多主导本月多容易在事业上产生竞争，自身多不利于项目竞争，只有私下去参与竞争，不能明目张胆的参与竞争，自己多不占据优势。其次，本月不利于应聘求职，不利于考试考核。'},
        {'header': '申猴', 'isAll': 2, 'img': require('./021.png'), 'title1': '运气呈下行势头，事业上可利于技术上的合作，后期的话求偏财多阻力和奔波，但适合暗中进行项目合作，会有一定收获。6日“芒种”节气后，将步入“偏印坐官”之运，月干透出偏印，多主导本月生肖猴事业上多利于职称提升，利于考试考核，但需要自身努力去争取。月建为生肖猴的正官和太岁为午戌半合火局，构成了正官生偏印，主导私下利于待遇提升，容易得到政策的倾斜照顾。', 'title2': '本月生肖猴女生逢月建为正官，为女生的异性星，主导生肖猴的女生异性缘略旺，可以有一定的机遇，但本月毕竟不为生肖猴的桃花，所以还需要多主动去争取，不宜被动，否则感情上难有突破。而男生的话，则异性缘较差，唯有寄希望于长辈的帮助。', 'title3': '本月月干透出偏印，月建和太岁构成了正官生偏印，多主导生肖猴本月利于待遇提升，容易得到贵人的关照而利于自身，容易得到长辈的关照和扶持，但自身也需要努力去争取机遇，否则虽然没有破财的隐患，但要获得更多利益也颇难。', 'title4': '本月事业上逢“偏印坐官”，多主导日常事业上会有一些潜在的压力，但能够得到领导上的关照，利于考试考核，利于职称提升，利于应聘求职，利于文化项目的合作等。'},
        {'header': '酉鸡', 'isAll': 2, 'img': require('./022.png'), 'title1': '运气呈下行势头，事业上略有费心，但可得到贵人的关照和扶持，利于项目合作，利于自身物质运。6日“芒种”节气后，将步入“正印坐官”之运，本月逢正印透出，多主导本月多利于考试考核，职称提升，待遇提升。而月建为偏官遭遇生肖鸡为相克相破的关系，同时月建和太岁构成了午戌半合火局，为杀印相生的组合，多主导利于待遇提升，可以把压力转化为际遇和动力。', 'title2': '本月生肖鸡女生逢月建为红鸾星出现，多主导易有异性缘，但也容易给生肖鸡带来压力，多遇到热情阳光有气质的异性，其中对于生肖鸡女生来说相对有利，因为月建为其异性星，男生的话则有时会略有压应力。', 'title3': '本月逢正印透出而坐下为偏官，且偏官和太岁构成了杀印相生，但此偏官星对生肖鸡有一定的克制。主导生肖鸡本月容易得到贵人的关照，长辈的关照而利于自身，同时本月利于待遇提升，可以把危机转化为际遇，虽然发不了大财，但物质运相对不错，但也不宜违规，否则也会受到惩罚。', 'title4': '本月逢“偏印坐官”，多主导本月易得到副职领导的关照，利于职称提升，利于考试考核，利于待遇提升，甚至可能会有一些升职的机遇，但容易是副职。其次，也主导私下容易存在一些压力，可能是执法部门或是副职领导严格督促的原因。'},
        {'header': '戌狗', 'isAll': 2, 'img': require('./023.png'), 'title1': '运气呈上行势头，事业上利于项目合作，利于和领导上司之间的协作，但不宜争强好胜和冲动，否则多生波折和引发破财。6日“芒种”节气后，将步入“比肩坐印”运，本月比肩透出，多主导日常多需要抛头露面，多需要主动去争取，也主动本月自身主动意识比较强。月建为生肖狗的正印且和太岁构成了午戌半合火局，多主导生肖狗私下易得贵人相助，多利于业绩或是学业进修，利于待遇提升，利于应聘求职，利于职称提升等。', 'title2': '本月生肖狗逢月建构成了午戌半合火局，多主导生肖狗平时人缘不错，但桃花不现，故需要加倍努力，通过自己的人缘关系而在异性缘方面得到突破。另外，本月因为月建正印星和生肖狗构成了合局，所以也可以让家里的女性长辈给自己物色不错的异性，也可以在异性缘方面得到突破。', 'title3': '本月财星不出，但生肖狗逢太岁和月建半合火局，而生肖狗临本命年，自身入局而得印生。主导生肖狗本月容易因为项目合作而多有收获，容易得到贵人的关照和扶持而利于自身，容易得到长辈的关照和馈赠而令自身物质运得到提升，利于待遇提升，长辈的继承等。', 'title4': '本月事业上逢“比肩坐印”运，多主导日常事业上多利于学业上的提升，或利于学习进修，利于职称提升，利于待遇提升，利于项目合作，利于火电热的项目合作，或是文化项目合作，利于为自己的日后仕途而铺路。'},
        {'header': '亥猪', 'isAll': 2, 'img': require('./024.png'), 'title1': '运气呈下行势头，但事业上后期利于项目合作，利于技术上的合作，但也多劳心。6日“芒种”节气后，将步入“偏官坐财”之运，本月月干透出偏官，多主导本月多容易和副职领导，执法部门等增加接触，容易有压力，有时也要注意防盗防骗。月建为生肖猪的正财星，多主导生肖猪私下正财运不错，可通过不公开合作而去获得收益。但本月月建和太岁为午戌半合火局，为正财生了偏官，所以还需要提防私下被骗，或是因为一些阳光项目而被套。', 'title2': '本月生肖猪逢正财星午火构成了午亥暗合，多利于生肖猪男生的异性缘，多主导私下易有约会，但是生肖猪男生也要提防竞争，或是对方脚踏几条船的情况。至于生肖猪女生的话则异性缘也不错，但也要注意不要因为异性而让自己花费过多，造成经济上的压力，建议不要有经济上的深度交往，日常正常开支可以不计较。', 'title3': '本月正财星临月建而和生肖猪有午亥暗合的关系，多主导生肖猪私下会有一定的正财运，但因为偏官星透出不为吉利，所以也要提防被骗被套，被一些所谓的阳光项目而令自己入局，造成破财。', 'title4': '本月逢“偏官坐财”之运，多主导利于生肖猪在本月多容易和领导上司多有接触，容易面临一定的压力，容易受到严格的督促。同时，也主导私下利于和副职领导或是执法部门的一些项目合作，但自身的业绩提升不是太多，多容易事倍功半。'}
      ]
    }
  },
  methods: {
    goToUser () {
      router.push('/star')
    }
  },
  created () {
    console.log(this.$route.params.id)
    this.list = this.lists[this.$route.params.id - 1]
  }
}
</script>

<style scoped>
.show {
  height: 100%;
  min-height: 12rem;
}
.show header {
  padding: .3rem 0;
  text-align: center;
  font-size: .34rem;
  color: rgb(34,34,34);
  background-color: #fff;
}
.show header img {
  width: .2rem;
  height: .35rem;
  position: absolute;
  padding-left: .4rem;
}
.main {
  display: flex;
  flex-direction: column;
  background: url("./bg2.jpg") no-repeat center center;
  background-size: 100% 100%;
  padding-top: .4rem;
}
.main-img img{
  width: 3rem;
  margin: auto;
}
.main-text {
  text-align: center;
  font-size: .32rem;
  margin: .4rem;
  margin-bottom: 0;
  padding-bottom: .4rem;
  color: #fff;
}
.bottom {
  padding: 0 .4rem .4rem .4rem;
}
.bottom-flex {
  display: flex;
  flex-direction: column;
  color: #000;
}
.flex1 {
  padding-top: .4rem;
}
.flex1 img{
  width: .5rem;
  margin: auto;
}
.flex1 img.img1 {
  width: .51rem;
  height: .35rem;
}
.flex1 img.img2 {
  width: .42rem;
  height: .36rem;
}
.flex1 img.img3 {
  width: .39rem;
  height: .38rem;
}
.flex1 img.img4 {
  width: .44rem;
  height: .36rem;
}
.flex2 {
  text-align: center;
  padding: .2rem;
  padding-bottom: 0;
  font-size: .28rem;
  color: #999999;
  display: flex;
  flex-direction: row;
  justify-content: space-around;
}
.line {
  width: 2.5rem;
  border-bottom: 1px solid #d7d7d7;
  position: relative;
  top: -.15rem;
}
.flex3 {
  text-indent: .48rem;
  font-size: .26rem;
  padding: .2rem;
  color: #000;
}
</style>
